#!/usr/bin/env python 
#coding:utf-8

import Queue
import threadpool
import time
import urllib
from lxml import etree

import requests,pickle,json,os
from bs4 import BeautifulSoup

#from conf.config import foodtype,names
#from crawl_food import gather_food
from write_exal import writeexal


class fengjing(object):
    def __init__(self, demourl="https://zhidao.baidu.com/search?word={}++%3F&ie=gbk&site=-1&sites=0&date=0&pn={}",names={}):
        self.demourl = demourl
        self.names = names
        self.jdurl = []
        self.url = {}
        self.content = {}
        self.contentmax = {}
        self.noneurl = {}
        self.headers = {
            'user-agent': "Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/54.0.2840.71 Safari/537.36",
            "accept-Language": "zh-CN,zh;q=0.8",
            "Accept-Encoding": "gzip, deflate, sdch",
            "Accept": "text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8",
            "Connection": 'keep-alive',
            }
    def has_key(self):
        klist = []
        for i in os.listdir('text'.decode('utf8').encode('gbk')):
            if i.endswith('_lt240.xls'):
                m = i.split('_')[0][4:].decode('gbk').encode('utf8')
                klist.append(m)
        return klist
    def get_url(self):
        haskey = self.has_key()
        count = 0
        for local, jidian in self.names.items():
            for name in jidian:

                if name in haskey:
                    print 'has',name
                    continue

                name2 = urllib.urlencode({"word": '%s  ?' % name})
                for num in range(70):
                    self.jdurl.append(self.demourl.format(name2, num))
                self.question_and_url()
                self.question_and_answer()
                name1 = local + name
                try:
                    writeexal(self.content, name1.decode('utf8').encode('gbk'), 'lt240')
                    writeexal(self.contentmax, name1.decode('utf8').encode('gbk'), 'gt240')
                except:pass
                #调试信息输出代码
                #writeexal(self.noneurl, name1.decode('utf8').encode('gbk'))
                count = count + len(self.content.keys())
                print count
                #设置断点抓取多少后停止
                if count >= 10000:
                    print 'the process is run down'
                    break
                self.jdurl = []
                self.url = {}
                self.content = {}
                self.contentmax = {}
                self.noneurl = {}

        #print 'frist jdurl', len(self.jdurl)

    def question_and_url(self):

        t = 1
        start = time.time()

        q = Queue.Queue()

        for u in self.jdurl:
            q.put(u)
        lst = [q.get() for i in range(q.qsize())]
        pool = threadpool.ThreadPool(10)
        requests = threadpool.makeRequests(self.thread_guangxi, lst)
        for req in requests:
            try:
                pool.putRequest(req)
            except Exception,e:
                print e

        pool.wait()
        end = time.time()
        #print "all url time %s" % (end - start)
        #print "all url number %s" % len(self.url.keys())

    def question_and_answer(self):
        start = time.time()
        q = Queue.Queue()

        for u in self.url:
            q.put(u)
        lst = [q.get() for i in range(q.qsize())]
        pool = threadpool.ThreadPool(10)
        #requests = threadpool.makeRequests(self.thread_answer, lst)
        requests = threadpool.makeRequests(self.thread_answer_etree, lst)
        t = 1
        n = 1
        for req in requests:
            try:
                pool.putRequest(req)
            except Exception,e:
                print e
            t += 1
            if t == 100:
                print 'clraw 100 of the number is %s' % n
                n += 1

                t = 1
        pool.wait()
        end = time.time()
        print "all answer time %s" % (end - start)
        #print "all answer number %s" % len(self.url.keys())

    def thread_guangxi(self, u):
        #目前在用的抓取规则、通用知道内容
        content = requests.get(u,timeout=5).content
        soup = BeautifulSoup(content, 'lxml')
        ##print  soup.prettify()
        dl = soup.find_all('dl', class_="dl")

        for i in dl:

            question = i.find('a', class_='ti').text
            if len(question) > 25:
                continue
            # print i.find('a',target='_blank')['href']
            URL = i.find('a', target='_blank')['href']
            self.url[URL] = question

    def thread_question(self, u):
        #废弃 抓取标签不够优化
        content = requests.get(u).content

        if content is None:
            return None
        soup = BeautifulSoup(content, 'lxml')
        dt = soup.find_all('dt', class_="dt mb-4 line")
        # print dt
        # print len(dt)
        for i in dt:
            question = i.a.text
            if len(question) > 25:
                continue
            URL = i.a['href']
            self.url[URL] = question


    def thread_answer_etree(self, u):
        content = requests.get(u, headers=self.headers, timeout=5).content
        if content is None: return None
        root = etree.HTML(content)
        question = root.xpath("//span[@class='ask-title ']/text()")[0]
        #import pdb;pdb.set_trace()
        answer = root.xpath("//pre[@accuse='aContent']/text()")
        #print  question, len(answer)
        if len(answer) is None:
            return  None
        elif len(answer) > 240:
            self.contentmax[question] = answer
        elif len(answer) > 0:
            self.content[question] = answer
        time.sleep(0.5)

    def thread_answer(self, u):
        # 线程池执行抓取到百度知道最佳答案，筛选过滤到
        # for i in self.url:

        content = requests.get(u, timeout=5).content
        # print u,len(content)
        soup = BeautifulSoup(content, 'lxml')
        question = self.url[u]
        # question = soup.find('span', class_="ask-title").string
        pre = soup.find('pre', accuse="aContent")
        if pre == None:
            # self.noneurl[u] = question
            pass
        else:
            answer = ''.join(pre.text.split())
            if len(answer) > 240:
                self.contentmax[question] = answer
            elif len(answer) > 0:
                self.content[question] = answer
                # print  question+':'+answer


if __name__ == "__main__":
    starttime = time.time()
    url = "http://zhidao.baidu.com/search?{}&ie=gbk&site=-1&sites=0&date=0&pn={}0"
    # url = 'https://www.baidu.com/s?{}&pn={}&tn=monline_4_dg&ie=utf-8&usm=2&rsv_pq=e8df32730003508f&rsv_t=5cc0iLhYrVMJrYicqApUNrHV8HA28n6RhornMyijQdtIaBc1El9Wd6MppDsSvlKZIapQ'

    

    fengjng = {#'广西':['银子岩','阳朔西街','阳朔遇龙河','世外桃源','漓江','古东瀑布','兴坪漓江','龙脊梯田','桂林漓江精华漂流','日月双塔','榕杉湖','桂林大漓江游船','印象刘三姐','月亮山','世外桃源','十里画廊','阳朔蝴蝶泉','桂林独秀峰.王城（靖江王府）','象鼻山公园','訾洲公园','阳朔大榕树','德天瀑布','桂林冠岩','十里画廊','兴坪古镇','山水间','象山景区','遇龙河-多人漂','北海银滩','冠岩','通灵大峡谷','木龙湖','漓江游船','正阳步行街','北海老街','北海银滩旅游度假区','小漓江','南溪山公园','刘三姐大观园','蝴蝶泉','遇龙河-夏塘双人漂','阳朔图腾古道','古东森林瀑群','桂林两江四湖','訾洲岛','涠洲岛','一江四湖景区','巴马长寿村','北海涠洲岛火山国家地质公园','聚龙潭','明仕田园','百鸟岩','梦幻漓江','兴坪渔村','南宁民歌湖风景区','百魔洞','黄洛瑶寨','叠彩山','象山传奇','金坑梯田','靖江王城','兴坪-九马（竹筏游）','桂林义江缘','七星景区','杨堤','中越53号界碑','伏波山','巴马','桂林西山景区','黄布倒影','鉴山寺','尧山','尚水街','北海海洋之窗','龙脊大寨','独秀峰王城','北海红树林','穿山岩','北部湾广场','画山峡谷','九马画山','龙脊古壮寨','大圩古镇','金水岩','王城','穿岩古榕','西江千户苗寨','冠岩山','凤凰古城','訾洲','白龙洞','北海海底世界','涠洲岛主标志广场','芦笛岩','奇石宫','北海海滩公园','小七孔','杨堤-兴坪（竹筏游）','东郎山'],
            #'贵州':['西江千户苗寨','小七孔','黄果树','黄果树大瀑布景区','陡坡塘瀑布','青岩古镇','天星桥','大七孔','花溪湿地公园','镇远古城','马岭河峡谷','万峰林','西江','贵州黔西南双乳峰景区','镇远舞阳河风景区','下司古镇','黔灵山公园','安顺龙宫风景名胜区','梵净山','织金洞','日月双塔','甲秀楼','天河潭','息烽集中营','肇兴侗寨','黔东南苗侗区','阳朔遇龙河','岜沙苗寨','西江苗族博物馆','古东瀑布','银子岩','高坡云顶滑雪场','青龙洞','贵州省博物馆','弘福寺','贵阳南江大峡谷','贵州赤水大瀑布景区','阳朔西街','南江大峡谷漂流景区','贵阳红枫湖景区','杉木河','世外桃源','白马峪温泉','贵阳息烽温泉','世外桃源','两湖会馆','施秉云台山','桃源河漂流','剑河温泉','石桥村','三宝侗寨','石桥村','东门街','凯里苗侗风情园','贵阳修文苏格兰牧场','大型舞蹈史诗《古韵镇远》','云谷田园生态农业观光公园','清镇盘龙洞','时光贵州','卡拉村','红枫山韵茶场','荣华庄园','中国名酒收藏博览馆','付家大院','飞云大峡谷','黄平浪洞森林温泉','野洞河','黄平飞云崖','高过河风景区','高要梯田','黄果树瀑布盆景园','桂林漓江精华漂流','龙脊梯田','黄果树神龙洞','遵义会议旧址','凤凰古城','山水间','四洞沟景区','赤水','冠岩','漓江游船','訾洲岛','梵净山佛教文化苑','茂兰保护区','桂林大漓江游船','漓江','赤水丹霞','西江千户苗寨观景台','西江','佛光岩景区','訾洲公园','象山传奇','木龙湖','赤水景区','亚木沟','樟江经典文化游','金海雪山','水春河','梦幻漓江'],
            '重庆':['天坑三硚','仙女山','武隆地缝','天生三桥','长江三峡','洪崖洞','三峡大坝','重庆奉节白帝城','渣滓洞','白公馆','磁器口','丰都鬼城','龙水峡地缝','瞿塘峡','石宝寨','重庆湖广会馆','巫峡','芙蓉洞','重庆巫山小三峡','大足石刻','重庆神女溪','芙蓉洞','云阳龙缸','西陵峡风景区','重庆云阳张飞庙','黑山谷','三峡橘海景区','阿依河','龚滩古镇','乌江画廊','鬼城丰都','乐和乐都主题公园','重庆永川茶山竹海','重庆长江索道','芙蓉江','巫山','重庆野生动物园','重庆长寿湖','解放碑步行街','抗战遗址博物馆','重庆解放碑','长寿古镇','桃花源','大木花谷','西陵峡口','大佛寺','重庆人民大礼堂','濯水古镇','三峡人家风景区','金佛山','重庆万盛区龙鳞石海','科技馆','大木花谷','千野草场','万州大瀑布','小南海','红池坝国家森林公园','佛影峡','黄水','虎峰山','金凤','加勒比水世界','钓鱼城','重庆影视城','高峡平湖','神龟峡','涞滩古镇','四面山国家重点风景名胜区','神龙峡','统景','东温泉','张关水溶洞','重庆龙门阵欢乐水魔方','重庆航空温泉','北峰山','重庆海昌加勒比海水世界','重庆海棠晓月温泉温泉度假圣地','垫江牡丹生态旅游区','长江三峡','武隆天坑寨子景区','东方民族温泉','朝天门码头','嘉陵江','重庆皇池水会','龙兴古镇','南川北固','坛子岭','锦里','重庆金源方特科幻公园','黔江风景区','三峡大瀑布','宽窄巷子','杜甫草堂','乐天花谷','重庆兰花科技园','重庆十八梯','宝顶山','都江堰','金沙遗址'],
            '山东':['崂山','五四广场','奥帆中心','小青岛公园','栈桥','定远舰','刘公岛','八仙渡','青岛海底世界','北九水','黄岛金沙滩','青岛葡萄酒博物馆','八大关','蓬莱阁','青岛海昌极地海洋世界','青岛方特梦幻王国','大珠山','胶州湾跨海大桥','刘公岛博览园','泰山风景名胜区','奥运观光塔','崂山垭口','八水河','青岛海上观光','华严寺','青岛啤酒博物馆','蓬莱','水准零点','曲阜孔庙、孔府、孔林','仰口风景游览区','青岛天主教堂','信号山','旅顺蛇博物馆','星海广场','德式官邸旧址','趵突泉','石老人海水浴场','海云庵民俗文化馆','青岛奥帆奇幻世界','小鱼山公园','第一海水浴场','东鸡冠山日俄战争遗址','巨峰','太清宫','汇泉海水浴场','青岛德国总督楼旧址博物馆','龙潭瀑布','军港公园','中山公园','音乐广场','鲁迅公园','第二海水浴场','康有为故居','花石楼','石老人观光园','孔林','孔府','凤凰峡','灵山岛','即墨','大泽山','海军博物馆','青岛森林野生动物世界','夏庄','琅琊台景区','琅琊台','琅琊古城','天柱山摩崖刻石','灵珠山滑雪场','清闲庄园滑雪场','华夏城','华东百利酒庄','毛公山','金山滑雪场','孔庙','济南大明湖公园','海泉湾温泉','劈柴院','城投温泉','虎雕广场','八仙过海','银沙滩','青岛信号山公园','汤泊温泉','金麒玉麟温泉','胶澳总督府','艾丽华温泉','白鹭湖温泉','即墨温泉','鸿源御都温泉','天泰温泉','香根温泉','日月谷假日温泉','南天门','旅顺','十八盘','青岛海泉湾度假区','曲阜旅游','海阳海立方欢乐水世界'],
            #'北京':['瓷房子','古文化街','海河','故宫','八达岭长城','王府井','颐和园','水立方','天坛','静园','鸟巢','毛主席纪念堂','塘沽','天安门广场','天津方特欢乐世界','清华大学','天津海昌极地海洋世界','天津欢乐谷','什刹海','中国人民革命军事博物馆','海河外滩公园','洋货市场','意式风情区','意式风情街','周恩来邓颖超纪念馆','恭王府','盘山','天安门','天鹅湖温泉度假村','张学良故居','新城凯悦酒店温泉','极地海洋馆','天津欢乐水魔方','津湾广场','梨木台自然风景区','基辅号航母','天津意大利风情旅游区','圆明园','北京奥林匹克公园','南锣鼓巷','梁启超故居与饮冰室','望海楼教堂','蓟县','天津之眼摩天轮','天塔','五大道','中国皇家菜博物馆','鸟巢体育场','北京国家大剧院','龙达温泉','光合谷温泉','香山公园','北京朝阳剧场杂技','奥林匹克公园冰雪王国','雍和宫','明定陵','马可波罗广场','天津动物园','天后宫','天津广播电视塔','塘沽文化墙','新盘山滑雪场','盘山广场','塘沽森林公园','盘山烈士陵园','独乐寺','塘沽区','津城静园','盘山滑雪场','北塘','盘山北少林寺','滨海航母主题公园','渔阳城楼','希乐城少儿职业探索乐园','天津九龙山国家森林公园'],
            '河北':['避暑山庄','普宁寺','普陀宗乘之庙','普佑寺','须弥福寿之庙','外八庙','承德避暑山庄博物馆','白鹿温泉','木兰围场','承德枫水湾森林温泉城','金山岭长城','承德棒槌山（馨锤峰）','磬锤峰国家森林公园','磬锤峰','磬棰峰','僧冠峰','魁星楼','白石山国家地质公园','白草洼国家森林公园','茅荆坝森林公园','沕沕水','双塔山','白洋淀','暖泉古镇','安远庙','塞罕坝国家森林公园','热河城隍庙','溥仁寺','丰宁国家森林公园','天子山九道石斛','御道口草原森林','关帝庙','城隍庙','罗汉山','普乐寺','殊像寺','普仁寺','七星湖','百花坡','泰宁九龙潭','金牛洞','文庙','白云古洞','潘家口水库','辽河源国家森林公园','清舒山馆','青莲岛','沧浪屿','锤峰落照','红松洼自然保护区','冰臼公园','玻璃艺术馆','都山','光头山','黄土梁水库','窟窿山','喇嘛山','滦河上游','六里坪','平泉县博物馆','千松坝森林公园','青松岭大峡谷','塞北第一泉','桃山湖','佟山公园','五道沟','云雾山森林公园','泽州园','转山湖','海留图','神龙潭景区','碧峰洲草原','坝上汤温泉城','天域温泉庄园','热河温泉','承德朝阳洞','承德坝上草原·草原风农家院','承德坝上草原·草原风农家院','大汗行宫','京北第一草原','金牛洞','塞外潘龙湖','九龙松','冰雪城','坝上草原','青龙潭','康熙温泉行宫度假村','董存瑞烈士陵园','塞外蟠龙湖','雾灵山','九龙潭','庙宫水库','塞罕坝','白石山','孤石军马场度假村','泰丰湖','朝阳洞','元宝山滑雪场'],
            '黑龙江':['长白山风景区','雪乡','中央大街','亚布力','哈尔滨冰雪大世界','圣索菲亚大教堂','防洪纪念塔','雪乡梦幻家园','斯大林公园','雾凇岛','雪乡大雪谷','亚布力新体委滑雪场','镜泊湖风景名胜区','哈尔滨极地馆','哈尔滨伏尔加庄园','亚布力滑雪场','长白山北坡','俄罗斯风情小镇','哈尔滨太阳岛风景区','双峰林场','长白山北景区','亚布力雪上乐园','北极村','长白山魔界风景区','雪谷','漠河','吉林雾凇','太阳岛公园风景区','亚布力观光缆车及世界第一滑道','第四十届中国哈尔滨冰灯艺术游园会','哈尔滨莫斯科大剧院','哈尔滨动物园','亚布力好汉岭滑雪场','亚布力雅旺斯滑雪场','龙塔','哈尔滨冰球馆','东北虎林园','哈尔滨首届泳动龙江冰雪乐园','哈尔滨白渔泡国家湿地公园','亚布力森林小火车','圣索非亚教堂','关东古巷','亚布力景观大道','胭脂沟','哈尔滨永泰世界主题乐园','哈尔滨3D错觉艺术馆','亚布力大青山滑雪场','松花江索道','哈尔滨北大荒现代农业园','老里克湖','哈尔滨啤酒博物馆','亚布力国际会展中心滑雪场','长白山火山遗址','长白山万达国际旅游度假区','五大连池','尚志好汉岭滑雪场','二道白河镇','龙珠二龙山滑雪场','凤凰山国家森林公园','梦幻乐园','万达长白山滑雪场','大顶子山滑雪场','731部队罪证遗址','风车山庄','二龙山','兆麟公园','香炉山','松峰山','上京会宁府遗址','平山','威虎山影视城','金龙山国家森林公园','帽儿山','英杰温泉小镇','葫芦湾风景区','松峰山自然保护区','北极村国家森林公园','吉华（长寿山）滑雪场','天池','上京滑雪场','平山神鹿滑雪场','北方森林动物园','长寿山国家森林公园','香炉山风景区','大青山','尚志新濠阳光滑雪场','雾淞','渤海国遗址','渤海国','八女投江纪念地','渤海风情园','国家森林公园滑雪场','吊水楼瀑布','亚布力虎峰岭风景区','丁香科技博览园','牡丹峰国家森林公园','五营国家森林公园','玉泉','玉泉狩猎场'],
            #'辽宁':['星海广场','旅顺蛇博物馆','棒棰岛','金石滩','老虎滩海洋公园','旅顺','军港公园','滨海路','定远舰','旅顺口','东鸡冠山北堡垒','海之韵公园','东鸡冠山日俄战争遗址','八仙渡','刘公岛','俄罗斯风情街','虎雕广场','大连发现王国','大连圣亚海洋世界','崂山','五四广场','栈桥','大连香洲旅游度假区','沈阳方特欢乐世界','大连森林动物园','沈阳棋盘山风景区','奥帆中心','小青岛公园','辛巴达欢乐城堡','辽宁旅顺白玉山景区','旅顺鳄鱼园','大连旅顺蝶恋花蝴蝶园','女子骑警基地','沈阳故宫','海洋极地馆','小黑山','北九水','金石唐风温泉','鸡冠山','大黑山','星海公园','关东军司令部旧址','刘公岛博览园','步云山','大连东泉温泉','铭湖滑雪场','长兴岛','冰峪沟','南子弹库','安波温泉','安波光明温泉','铭湖温泉','金石滩旅游度假区','安波滑雪场','冰峪','大连旅顺天沐温泉','成园温泉','横山书院','大长山列岛','金斗湖','情人岛','骆驼山海滨森林公园','观海寺','伏龙古寺','格仙岛','广鹿岛','海王九岛','老帽山','李官','龙王庙','哈仙岛','瓜皮岛','凯伦温泉','老铁山温泉','大长山岛','张氏帅府','天门山国家森林公园','青岛海底世界','大连福慧温泉山庄','大连莲花山','大连老帽山风景区','石城岛','大连瓦房店李官虹桥温泉','大连歇马山庄国家森林公园','香格里汤泉宫','仙浴湾','北陵公园','三山岛旅游度假区','童牛岭','怪坡','圣谷美地漂流景区','沈阳棋盘山滑雪场','紫云花汐薰衣草花园','银石滩森林公园','永丰寺','西中岛','庄河','英纳湖','歇马山庄温泉'],
            '内蒙古':['星海广场','旅顺蛇博物馆','棒棰岛','金石滩','老虎滩海洋公园','旅顺','军港公园','滨海路','定远舰','旅顺口','东鸡冠山北堡垒','海之韵公园','东鸡冠山日俄战争遗址','八仙渡','刘公岛','俄罗斯风情街','虎雕广场','大连发现王国','大连圣亚海洋世界','崂山','五四广场','栈桥','大连香洲旅游度假区','沈阳方特欢乐世界','大连森林动物园','沈阳棋盘山风景区','奥帆中心','小青岛公园','辛巴达欢乐城堡','辽宁旅顺白玉山景区','旅顺鳄鱼园','大连旅顺蝶恋花蝴蝶园','女子骑警基地','沈阳故宫','海洋极地馆','小黑山','北九水','金石唐风温泉','鸡冠山','大黑山','星海公园','关东军司令部旧址','刘公岛博览园','步云山','大连东泉温泉','铭湖滑雪场','长兴岛','冰峪沟','南子弹库','安波温泉','安波光明温泉','铭湖温泉','金石滩旅游度假区','安波滑雪场','冰峪','大连旅顺天沐温泉','成园温泉','横山书院','大长山列岛','金斗湖','情人岛','骆驼山海滨森林公园','观海寺','伏龙古寺','格仙岛','广鹿岛','海王九岛','老帽山','李官','龙王庙','哈仙岛','瓜皮岛','凯伦温泉','老铁山温泉','大长山岛','张氏帅府','天门山国家森林公园','青岛海底世界','大连福慧温泉山庄','大连莲花山','大连老帽山风景区','石城岛','大连瓦房店李官虹桥温泉','大连歇马山庄国家森林公园','香格里汤泉宫','仙浴湾','北陵公园','三山岛旅游度假区','童牛岭','怪坡','圣谷美地漂流景区','沈阳棋盘山滑雪场','紫云花汐薰衣草花园','银石滩森林公园','永丰寺','西中岛','庄河','英纳湖','歇马山庄温泉'],
            '陕西':['秦始皇帝陵兵马俑博物院','华清宫','华山','西安明城墙','法门寺','乾陵景区','大雁塔','陕西黄河壶口瀑布','大明宫','枣园革命旧址','黄帝陵轩辕庙','骊山','陕西历史博物馆','秦始皇陵','大明宫遗址博物馆','钟鼓楼','杨家岭革命旧址','黄帝陵旅游区','西安大唐芙蓉园','永兴坊','半坡博物馆','秦陵地宫展览馆','大唐西市','高家大院','秦王地宫','小雁塔','翠华山旅游风景区','浐灞国家湿地公园','延安革命纪念馆','楼观台国家森林公园','临潼华清爱琴海温泉','曲江海洋世界','懿德太子墓'],
            '新疆':['天山天池','坎儿井','火焰山','葡萄沟','交河故城','天山','博斯腾湖','罗布人村寨','克孜尔千佛洞','新疆国际大巴扎','塔里木沙漠公路','库木塔格沙漠','天山大峡谷','禾木','艾提尕尔清真寺','喀纳斯','五彩滩','天山天池生态馆','卡拉库里湖','喀纳斯湖','喀什噶尔老城','喀纳斯湖景区','苏公塔','鸣沙山','莫高窟','青海湖','塔里木河','红山公园','贾登峪','月亮湾','阿帕霍加墓','库车','吐鲁番博物馆','嘉峪关城楼','塔尔寺','维吾尔自治区博物馆','坎儿井民俗园','新疆古生态园','南山','布尔津','卧龙湾','那拉提草原','月牙泉','玉门关','东小天池','照壁山森林公园','库尔勒胡杨林','果子沟大桥','水磨沟','霍尔果斯口岸','白杨沟','七彩丹霞','沙坡头旅游景区','贺兰山岩画','华夏西部影视城','卓尔山风景区','茶卡盐湖','日月山','倒淌河','马牙山','水西沟滑雪场','乌鲁木齐儿童公园','人民公园','乌鲁木齐人民会堂','新疆地质博物馆','萨尔达坂草原','水上乐园','地质陈列馆','达坂城','壁照山','八路军驻新疆办事处纪念馆','塔塔尔寺','汗腾格里寺','南大寺','唐布拉草原','乌鲁木齐博物馆','九龙生态园','神木生态园','盛贝特海洋水族馆','法明寺','撒拉寺','喀拉峻大草原','解忧公主薰衣草庄园','夏塔古道','奎屯红山大峡谷','托乎拉苏大草原','库尔德宁草原','阔克苏大峡谷','特克斯八卦城','原始野杏林','大西沟野果林','乌鲁木齐职业大学','新疆喀拉峻国际生态旅游区','民街民俗博物馆','乌鲁木齐市植物园','雅马里克山','盐湖','燕尔窝','雷鸣山庄'],
            '甘肃':['莫高窟','鸣沙山','嘉峪关城楼','月牙泉','玉门关','敦煌','七彩丹霞','张掖冰沟丹霞景区','雅丹国家地质公园','雅丹魔鬼城','大佛寺','汉长城','塔尔寺','青海湖','天下第一墩','关城','悬臂长城','敦煌古城','阳关','拉卜楞寺','茶卡盐湖','郎木寺','中山桥','雅丹地貌','花湖','黄河铁桥','胡杨林','怪树林','马蹄寺','青海湖二郎剑景区','敦煌博物馆','水车园','黄河九曲第一湾','平山湖大峡谷','祁连山','沙坡头旅游景区','阳关遗址','黑城遗址','酒泉卫星发射中心','居延海','年宝玉则','卓尔山风景区','白塔山公园','贺兰山岩画','倒淌河','天山天池','长城博物馆','桑科草原','汉长城遗址','西夏王陵','水洞沟','金银滩草原','火焰山','坎儿井','敦煌莫高窟数字展示中心','西千佛洞','伏羲庙','天下第一雄关','宁夏沙湖生态旅游区','华夏西部影视城','青海湖鸟岛','门源','日月山','色达草原','若尔盖草原','交河故城','什川梨园','兴隆山景区','小西湖','马蹄寺千佛洞','嘉峪关方特欢乐世界','文物景区','山丹军马场','雷音寺','猪驮山风景区','沙湖','青海金银滩景区','湟源倒淌河','葡萄沟','南湖保护区','丝绸之路博物馆','兴隆山滑雪场','安宁滑雪场','钟鼓楼','镇北堡西部影城','仙女湾景区','原子城纪念馆','中国原子城','青海湖鸟岛景区','湟源峡','红原月亮湾','喀纳斯','胡杨林','万象洞景区','麦积山石窟','金塔沙漠森林公园','张掖市森林公园','汉明长城','香子沟'],
            '河南':['少林寺风景名胜区','龙门石窟','云台山','包公祠','红石峡','铁塔','老潭沟','清明上河园','清明上河园','嵩山','古阳洞','奉先寺','铁塔公园','潜溪寺','云台山猕猴谷','嵩山少林寺武术馆','少林寺塔林','重渡沟','开封府','东山石窟','香山寺','峰林峡','白马寺','秦始皇帝陵兵马俑博物院','青天河','龙亭公园','包公湖','丽景门','万仙山','郑州方特欢乐世界','华山','太行大峡谷','宋都御街','郭亮村','神州牡丹园','宝泉景区','林州红旗渠游览区','西安明城墙','老君山','洛阳牡丹花会','龙潭大峡谷','洛阳白云山','重渡沟竹林','牡丹公园','卢崖瀑布','大宋御河','隋唐洛阳城','宝泉西沟景区','青龙峡','黛眉山景区','开封铁塔光影秀','八里沟','国家牡丹园','鸡冠洞','华清宫','太行山大峡谷','天波杨府','林州洪谷山景区','林虑山国际滑翔基地','林虑山','大鸿寨','灞陵桥景区','大相国寺','林州太行滑雪场','许昌曹丞相府','林州天平山','郑州方特梦幻王国','高阳山温泉','嵩阳景区','关林庙','红旗渠','双龙湾','春秋楼','木札岭','嵩阳书院','万仙山滑雪场','尧山','黄河风景名胜区','伊河','中岳庙','乔家大院','平遥古城','殷墟博物苑','神灵寨森林公园','尧山福泉温泉','木札岭原始生态旅游区','丹江大观苑','尧山第一漂景区','尧山大峡谷漂流景区','洛阳天堂','五龙山响水河欢乐世界','地坑院景区','定鼎门遗址博物馆','七峰山生态旅游区','潭瀑峡','轿顶山风景区','山陕甘会馆','洛阳周王城天子驾六博物馆','三皇寨'],
            '湖南':['天门山','袁家界','凤凰古城','张家界国家森林公园','十里画廊','黄龙洞','天子山','天门洞','金鞭溪','张家界袁家寨子','黄石寨','杨家界','张家界土家风情园','武陵源','金鞭溪','御笔峰','张家界大峡谷','仙女献花','橘子洲','贺龙公园','金鞭溪大峡谷','韶山','三姐妹峰','湖南湘西矮寨大桥','宝峰湖','劈山救母','岳麓山','鬼谷栈道','迷魂台','寿星迎宾','芙蓉镇','沱江','卧龙岭','神堂湾','天心阁','毛泽东故居','水绕四门','西海石林','宝峰湖','百丈峡','索溪峪','柏乐园','橘子洲古董钢琴博物馆','光明蝶谷','花明楼','韶山毛泽东同志纪念馆','张家界大峡谷玻璃桥','百龙天梯','乌龙寨','五指峰','长沙生态动物园','天波府','天门狐仙','情人峰','水帘洞','南天门','长沙靖港古镇','南天柱','密印寺风景区','长沙世界之窗','神堂湾','简牍博物馆','宁乡千佛洞','浏阳石牛寨','大围山','通程温泉','空中走廊','长沙趣味蜡像馆','毛泽东铜像广场','黄龙泉','地矿陈列馆','观宝峰飞瀑','观音洞','文星岩','夫妻山','爱晚亭','黄狮寨','桑植','苗寨','杉林幽径','百丈峽','茶盘塔','雾海金龟','前花园','砂岩峰林公园','石家檐','德夯苗寨','响水河','龙泉瀑布','腰子寨','琵琶溪','龙王洞','砂刀沟','黄家大院','激流回旋漂流景区','鸳鸯潭','紫霞观','贺龙故居','紫草潭'],
            '湖北':['木兰天池','三峡大坝','黄鹤楼','东湖风景区','武汉东湖磨山景区','武汉海昌极地海洋世界','木兰云雾山','武汉园博园','胜天农庄','木兰草原','东湖海洋世界','武汉杜莎夫人蜡像馆','三峡人家风景区','恩施大峡谷','武汉九峰森林动物园','张公山寨','紫薇都市田园','木兰古门景区','农耕年华','东西湖郁金香主题公园','清江画廊','金龙水寨生态园','九真山风景区','龙泉山风景区','恩施土司城','三峡大瀑布','西陵峡风景区','恩施腾龙洞','神农架国家级自然保护区','土家女儿城','葛洲坝','武当山','重庆奉节白帝城','长江三峡','清江','西陵峡口','瞿塘峡','石宝寨','长江三峡','丰都鬼城','巫峡','坪坝营','天生桥景区','汉口江滩公园','恩施野三峡','神农坛景区','重庆巫山小三峡','汉秀剧场','高峡平湖','石门河','梭布垭','归元寺','楚河汉街','坛子岭','湖北天堂寨风景区','光谷步行街','万达电影乐园【奔跑吧兄弟，奔跑吧万达电影乐园】','三游洞','重庆神女溪','武昌起义纪念馆','武汉欢乐谷','武汉玛雅海滩水公园','截流纪念园','昭君故里','欢乐星球','世外桃源','快乐谷','三峡猴溪','咸宁温泉','武汉大学','车溪民俗风景区','坛子岭','欢乐谷趣玩吧','神农架保护区','湖北屈原故里','大九湖','武汉辛亥革命博物馆','宜昌三峡金狮洞','车溪','古琴台','爱来魔相艺术馆','玩购主题乐园','神农架神农顶风景区','万达儿童乐园','白马洞','下牢溪','龙进溪','锦里沟','九宫山','汉口','快乐谷','快乐谷','灯影峡','185观景平台','游船三峡人家','武落钟离山','两坝一峡','夷陵长江大桥','兴山昭君村景区'],
            '安徽':['黄山','宏村','西递','屯溪老街','九华山','千岛湖','黄山翡翠谷','塔川景区','合肥万达主题乐园','九龙瀑','芜湖方特梦幻王国','芜湖方特欢乐世界','翡翠谷','太平湖','齐云山','西海大峡谷','呈坎','鲍家花园','花山谜窟','黄山东海大峡谷凤凰源景区','芜湖方特东方神画','棠樾牌坊群','黄山温泉景区','黄山虎林园景区','李坑','徽州古城','黄山温泉','醉温泉','江湾村','徽州大峡谷','徽商大宅院','唐模村','南屏','唐模风景区','新安江山水画廊','西湖','乌镇','牯牛降自然保护区','卢村','新安江','晓起','黄山大竹海','秀里','黟县卢村木雕楼','黄山浮溪野生猴谷','黄山天湖景区（天湖欢乐谷、天湖漂流）','杨家寨','三溪大峡谷','休宁大熊猫生态乐园','木坑竹海','中山陵','婺源篁岭景区','屯溪博物馆','古徽州文化旅游区','石门峡','南屏村','香溪漂流','夫子庙','屏山村','黄山万粹楼博物馆','灵山景区','黄山龙池湾','阳产土楼','曹氏二宅','徽州府衙','普仁滩景区','最佳西方温泉','神龙大峡谷','黄山休宁古城岩','南湖','白际乡','徽州文化博物馆','戴震纪念馆','祁门牯牛降九龙景区','三口古镇','守拙园','秀里影视城','洞天湾风景区','桃源洞','石潭','雄村','明堂山','见明堂民俗博物馆','中国祁红博物馆','牯牛降历溪景区','潜口民宅博物馆','黄山牯牛降景区','天堂寨','夹溪河漂流','天湖漂流','白云宾馆','黄山枧潭漂流','桃花源漂流','颜公河漂流','源芳漂流','蓝水河漂流','养生河漂流','西海饭店','排云楼宾馆'],
            '浙江':['西湖','乌镇','苏州寒山寺','杭州宋城','狮子林','千岛湖','杭州黄龙洞','罗蒙环球乐园','西塘风景区','西溪湿地西区','周庄','东方明珠','唐寅园','杭州灵隐（飞来峰）景区','乌镇东栅','三国城影视基地','中山陵','上海城隍庙','拙政园','花港观鱼','黄浦江游船','普陀山风景区','灵隐寺飞来峰','上海迪士尼乐园','鼋头渚','杭州虎跑梦泉','七里山塘','夫子庙','乌镇修真观','宋城千古情','黄龙洞圆缘民俗园','雷峰塔','虎丘','灵山大佛','上海迪士尼度假区','乌镇西栅','留园','西溪国家湿地公园','横店影视城','阅江楼','印象西湖','大明山','莫愁湖公园','西塘·烟雨长廊','南浔古镇','虎跑公园','普济寺','盘门','秦王宫','黄浦江','溪口','紫竹林','西天景区','明清宫苑','西溪湿地(东区)','黄山','水浒城','朝天宫','迪士尼小镇','苏州定园','梦幻谷','西塘·根雕馆','外滩观光隧道','杭州大明山风景区','观音古洞','舟山群岛','灵石庵','普济禅寺','园林','奉化','杭州桐庐垂云通天河','千岛湖中心湖区','临安','河坊街','杭州六和塔','白云溪','灵隐寺','金茂大厦','雪窦山','杭州建德大慈岩','杭州临安白水涧','秦淮风光带','耦园','千岛湖林海归真','大奇山','明清民居博览城','弥勒大佛','红灯笼外婆家','青山湖','杭州桐庐富春桃源','西湖之夜','瑶琳仙境','森林氧吧','浙西','同里古镇','西湖天地','西湖音乐喷泉','桐庐','西湖外事游船'],

            '台湾':['忠孝西路','故宫博物院','国立国父纪念馆','中正纪念堂','日月潭','101大楼','台中放送局','阿里山','西门町','垦丁国家公园','九份','太鲁阁公园','台北宁夏夜市','七星潭自行车道','西门红楼','士林官邸','台北总统府','阳明山','驳二艺术特区','台北故宫博物馆','艋舺龙山寺','垦丁大街','高雄港渔人码头','爱河','淡水老街','打狗英国领事馆','台北101摩天大厦','九份老街','猫鼻头公园','台北故宫','台北故宫','西子湾','日月潭头社活盆地休闲农业区','日月潭蝴蝶园','野柳地质公园','日月潭慈恩堂','日月潭金针花海','台北101大楼','士林夜市','猫空茶园','清境农场','清境农场青青草原','山玥温泉','玄光寺','诚品书店','高雄捷运美丽岛站','国立台湾美术馆','猫空缆车','台北小巨蛋','阳明山','阳明山','台北市动物园','北投温泉','九份本地博物馆','九份风筝博物馆','九份金矿博物馆','九份风筝博物馆','宁夏夜市','清水断崖','高美湿地','地热谷','永康街','北投温泉博物馆','旗津海岸公园','东西横贯公路谷关风景区牌楼','佛光山佛陀纪念馆','外澳服务区','原住民一条街','核三厂出水口','鹅銮鼻','野柳地质公园','东山岛','风动石','东门屿景区','燕子口','七星潭','台北国立历史博物馆','台北梦幻湖','台北市立美术馆','台中八仙山','美丽华摩天轮','嘉义市立博物馆','宫原眼科','彩虹眷村','高雄市眷村文化馆','北投地热谷','花莲港','六合夜市','中台禅寺','士林官邸公园','佛光山佛教文物陈列馆','鹅銮鼻公园','屏东国立海洋生物博物馆','花莲光复糖厂','旗津风车公园','英国领事馆'],
            '海南':['天涯海角','蜈支洲岛','南山佛教文化苑','大东海','亚龙湾热带天堂森林公园','亚龙湾','三亚湾','呀诺达雨林','大小洞天','鹿回头公园','西岛景区','三亚奇幻艺术体验馆','美丽之冠','三亚市区','兰花世界','椰梦长廊','三亚藤海湾户外潜水俱乐部','凤凰岭','珠江南田温泉','椰田古寨','亚龙湾玫瑰谷','分界洲岛','三亚千古情','三亚凤凰岭海誓山盟景区','槟榔谷','亚龙湾中心广场','爱心大世界','龙仔湾','白色亭','白鹭公园','百乐国际潜水','凤凰岛','亚龙湾海底世界','南山文化旅游区','三亚万达—海棠秀','南湾猴岛','小东海','百越民族文化村','中国免税集团三亚免税店','凤凰岛德贝潜水水上运动中心','城市乐园','红艺人表演','呀诺达','古今来趣味蜡像馆','海底世界','长寿谷','情人桥','鹿回头之夜','海螺姑娘创意文化园','东瑁洲岛','观日岩','热带雨林广场','丽思卡尔顿酒店','兴隆热带植物园','德贝潜水水上运动中心','妈祖庙','牛鼻仔岭','三亚凤凰飞速卡丁车俱乐部','东西玳瑁洲','落笔洞','德贝潜水水上运动中心','福文化长廊','古崖州城','沃天堂主题乐园','红珊瑚潜水俱乐部','西沙海战烈士陵园','海盗吧潜水中心','贝壳馆','自然博物馆','南天生态大观园','仁王门','海之玉海洋温泉','蝴蝶谷','京润珍珠博物馆','泰象馆','宝宏大酒店','珊瑚礁保护区','珍珠文化馆','神州第一泉','三亚湾海居铂尔曼度假酒店','红树林度假世界','三道谷','皇后湾','牛车湾','黎客国际酒店','鸟巢度假村','凯宾斯基酒店','黎村苗寨','吉祥钟亭','梦幻谷','龙虎园','锦母角','天涯热带海洋动物园','凯莱度假酒店','藤海海湾','维景国际度假酒店','孔庙','雨林谷','黎村苗寨'],
            '云南':['丽江古城','大理古城','束河古镇','拉市海','崇圣寺三塔','玉龙雪山','双廊','蝴蝶泉','虎跳峡','普达措国家森林公园','洱海','玉龙雪山大索道','泸沽湖','蓝月谷','云南石林风景名胜区','洋人街','南诏风情岛','洱海','西双版纳野象谷','四方街','西双版纳原始森林公园','独克宗古城','丽江木府','长江第一湾','喜洲古镇','玉水寨','苍山','九鼎龙潭','崇圣寺','里务比岛','苍山感通索道','丽江万古楼','茶马古道','苍山大峡谷','西双版纳勐泐大佛寺','大研古城','西双版纳傣族园','苍山洗马潭索道','傣族村寨','西双版纳基诺山寨','大理州博物馆','碧塔海','三塔倒影公园','圣源寺观音阁','白沙壁画','西双版纳曼听公园','南诏太和城遗址','清碧溪','宜良九乡风景区','冰川公园','大理张家花园','感通寺','天龙八部影视城','海西海','观音塘','凤凰山','黑龙桥','花甸坝','南诏文化城','古佛洞','将军庙','鸡足山祝圣寺','宝林寺','眠龙洞','龙马水','天镜阁','五华楼','鸟吊山','洱源','云杉坪','西双版纳热带植物园','勐仑植物园','宝台山森林公园','茈碧湖','长春洞','严家大院','东山国家森林公园','叶榆天泽','白沙','周城','长江第一湾','滇池','打洛','鸡足山','西双版纳万达主题乐园','属都湖','岚霭普陀','普济寺','太和城遗址','万人冢','剑川石宝山','石宝寺','天生桥','剑湖','无为寺','七彩云南文博园','鹤庆','西双版纳望天树','景洪旅游'],
            '四川':['九寨沟','黄龙风景名胜区','都江堰','大熊猫繁育研究基地','青城山','成都国际非遗博览园','宽窄巷子','武侯祠','峨眉山','锦里','乐山大佛','成都南湖梦幻岛','春熙路步行街','杜甫草堂','浩海立方海洋馆','牟尼沟','成都欢乐谷','成都天堂岛海洋乐园','国色天乡陆地乐园','丹景山','成都海昌极地海洋世界','郫县古城遗址','青羊宫','刘氏庄园','虹口景区','新津','洛带古镇','大熊猫研究中心都江堰基地','金沙遗址','西岭雪山','中华蝴蝶生态城','平乐古镇','梨花沟','蒲江','成都石象湖景区','水磨','文殊院','四川天台山','西来','永陵博物馆','昭觉寺','松潘古城','五凤溪','四姑娘山','五彩池','中国古羌城','风情园','道源圣城','亚丁','都江堰茶溪谷','天堂部落藏家风情园','桃坪羌寨','新都桥镇','若尔盖草原','峨眉山生态猴区','泸定桥','稻城亚丁','成都国色天乡(香)摩天轮','国色天香','成都美洲四季滑雪场','川主寺','米亚罗','峨眉山博物馆','峨眉山灵秀温泉','紫颐香薰山谷','峨眉山滑雪场','锦江剧场','泸沽湖','峨眉山红珠森林温泉','峨眉山七里坪华生温泉','峨眉山大酒店瑜伽温泉','理县毕棚沟','若尔盖','泸沽湖走婚桥','国色天香游乐场','九鼎山','峨眉山天颐温泉','新津古藤堡疯狂农庄','峨眉山竹叶青生态茗园','黄龙溪古镇','映秀','峨眉山门','秀丽东方景区','九寨沟十二泉藏药温泉','乐山大佛景区','花水湾温泉度假区','四川旅行护照畅游天府旅行卡','海螺沟','花湖','四川卧龙国家级自然保护区','泸沽湖情人树','花水湾锦泰温泉','花水湾温泉第一村温泉','成都华阳镇','色达草原','青城道温泉（豪生温泉）','青城山五行仙谷汤池','康定古城','丽江古城'],
            '广东':['长隆欢乐世界','长隆野生动物园','长隆国际大马戏','长隆水上乐园','珠海长隆海洋王国','长隆飞鸟乐园','香江野生动物世界','广州沙湾古镇','碧桂园欢乐世界','宝墨园','珠海渔女','广州东升农场','珠海长隆横琴岛剧院','西冲','鳄鱼公园','杨梅坑','圆明新园','番禺','广州宝墨园·南粤苑','广州塔','海泉湾','东部华侨城','海洋温泉','岭南印象园','百万葵园','茶溪谷','大鹏所城','观澜山水田园','海心沙','东部华侨城大侠谷','飞鸟乐园','广州花都石头记矿物园','陈家祠','碧桂园儿童职业体验中心','长隆鳄鱼公园','增城白水寨','黄埔军校旧址','长隆旅游度假区','大鹏半岛国家地质公园博物馆','广州增城金叶子温泉','中英街','从化碧水湾温泉','大梅沙海滨栈道','宝趣玫瑰世界','外伶仃岛','锦绣香江温泉','崴格诗温泉','珠海航展中心','珠江夜游大沙头码头','淇澳岛','龙岩古寺','白云山','岭南水乡','珠海石景山观光索道','越秀公园','都城隍庙','巽寮湾','花城广场','珠海长隆国际海洋度假区','深圳小海马奇奇王国儿童拓展体验基地','大梅沙','三英温泉','天适樱花悠乐园','南沙湿地公园','花都香草世界','故乡里主题公园','大丰门','滨海泳场','从化仙沐园温泉','珠江','流溪河国家森林公园','深圳欢乐谷','茵特拉根温泉','广东美术馆','小梅沙海滨','东澳岛','梅溪牌坊','荷包岛','荔枝湾','共乐园','万山岛','五羊石雕','增城','名马轩度假山庄','西汉南越王博物馆','深圳世界之窗','响水峡','仁威庙','六榕寺','梦幻水城','桂山岛','狼道军事野战拓展体验基地','镇海楼','金色海岸游艇','淇澳岛白石街','溪头村','中山纪念堂','杨氏大宗祠','从化望谷温泉度假村'],
            '香港':['香港会展中心','香港迪士尼乐园','香港海洋公园','金紫荆广场','黄大仙祠','维多利亚港','太平山顶','浅水湾','香港杜莎夫人蜡像馆','太平山','香港天际100观景台','星光大道','大三巴牌坊','妈祖庙','香港挪亚方舟','铜锣湾','凌霄阁','金莲花广场','天星码头','天坛大佛','金钟','青马大桥','赤柱警署','中环','佐敦','旺角','港澳码头','渔人码头','湾仔','澳门观光塔','太子道','红勘','香港世界地质公园','九龙城','澳门新濠天地水舞间','香港3D奇幻世界','九龙塘','油麻地','香港大澳渔村','天后北角','香港海事博物馆','香港六方岩柱','香港体育馆','维多利亚港','西环','西环上环','古董街','重庆大厦','大炮台','观音像','尖沙咀','主教山小堂','香港海洋公园海洋馆','四面佛','赛马会','香港迪士尼','龙腾天幕','南丫岛','龙环葡韵住宅式博物馆','观音像','离岛','运动场','香港太空馆','大屿山','西贡','湾仔姻缘石','西九龙海滨长廊','西贡东郊野公园','西贡郊野公园','荃湾','中环至半山自动扶梯','文武庙','宝莲禅寺','旺角宠物街','南丫岛渔民文化村','马累岛','中葵涌公园','城门水塘','中环维港摩天轮','尖沙咀','尖沙咀','红磡体育馆','宝康公园','青衣东北公园','沙田公园','大浪西湾','大潭水塘','大澳岛','圣约翰大教堂','鲤鱼门','议事厅前地','澳门博物馆','北区公园','西贡海鲜街','旧湾仔邮政局','叮叮车','凌霄阁摩天台'],
            '西藏':['布达拉宫','大昭寺','羊卓雍措','八角街','西藏林芝雅鲁藏布大峡谷','扎什伦布寺','纳木措','西藏林芝巴松措景区','林芝八一镇','扎基寺','米拉山口','巴松错','拉萨河','色拉寺','西藏博物馆','楚布寺','卡定沟','尼洋阁','哲蚌寺','小昭寺','仓姑寺','宗角禄康公园','乃琼寺','羊八井地热温泉','功德林寺','次巴拉康寺','拉萨游乐园','羊八井','罗布林卡','扎耶巴寺','关帝庙','热振寺','西藏革命展览馆','鲁朗林海','扎西多寺','乃朗寺','藏王陵','甲玛王宫','鲁普岩寺','扎希寺','曲贡古遗址','德宗温泉','药王山','卓玛拉康寺','措木及日','日多温泉','珠峰大本营','南伊沟','布达拉宫广场','甘肃中医学院','南迦巴瓦峰','直贡梯寺','卡诺拉冰川','尼洋河','雅鲁藏布江','纳木错','比日神山','大昭寺广场','拉萨清真大寺','清真大寺','米堆冰川','色季拉山','秀巴古堡','道源圣城','都江堰茶溪谷','成都国色天乡(香)摩天轮','中华蝴蝶生态城','成都海昌极地海洋世界','都江堰','宽窄巷子','金沙遗址','春熙路步行街','刘氏庄园','锦里','丹景山','虹口景区','梨花沟','杜甫草堂','成都美洲四季滑雪场','洛带古镇','大熊猫繁育研究基地','三峡橘海景区','花水湾锦泰温泉','花水湾温泉第一村温泉','花水湾温泉度假区','鲁朗镇','波密','中流砥柱','绒布寺','墨脱','林芝松多镇','结巴村','五凤溪','西岭雪山','四川旅行护照畅游天府旅行卡','秀丽东方景区','新津古藤堡疯狂农庄','四川天台山','成都南湖梦幻岛'],
            #'广西':['银子岩','阳朔西街','阳朔遇龙河','世外桃源','漓江','古东瀑布','兴坪漓江','龙脊梯田','桂林漓江精华漂流','日月双塔','榕杉湖','桂林大漓江游船','印象刘三姐','月亮山','世外桃源','十里画廊','桂林独秀峰.王城（靖江王府）','阳朔蝴蝶泉','象鼻山公园','訾洲公园','阳朔大榕树','德天瀑布','桂林冠岩','十里画廊','山水间','兴坪古镇','象山景区','遇龙河-多人漂','冠岩','通灵大峡谷','北海银滩','漓江游船','木龙湖','正阳步行街','小漓江','北海老街','北海银滩旅游度假区','南溪山公园','刘三姐大观园','蝴蝶泉','遇龙河-夏塘双人漂','阳朔图腾古道','古东森林瀑群','桂林两江四湖','訾洲岛','涠洲岛','巴马长寿村','一江四湖景区','北海涠洲岛火山国家地质公园','百鸟岩','聚龙潭','明仕田园','兴坪渔村','梦幻漓江','南宁民歌湖风景区','百魔洞','叠彩山','黄洛瑶寨','金坑梯田','象山传奇','靖江王城','兴坪-九马（竹筏游）','桂林义江缘','七星景区','杨堤','中越53号界碑','伏波山','巴马','桂林西山景区','黄布倒影','鉴山寺','尧山','尚水街','龙脊大寨','北海海洋之窗','独秀峰王城','北海红树林','穿山岩','西江千户苗寨','北部湾广场','画山峡谷','龙脊古壮寨','九马画山','小七孔','大圩古镇','王城','金水岩','穿岩古榕','訾洲','青岩古镇','冠岩山','花溪湿地公园','凤凰古城','白龙洞','北海海底世界','涠洲岛主标志广场','芦笛岩','北海海滩公园','奇石宫'],
            '宁夏':['贺兰山岩画','沙坡头旅游景区','镇北堡西部影城','水洞沟','宁夏沙湖生态旅游区','中华回乡文化园','西夏风情园','西夏王陵','华夏西部影视城','沙湖','鸣翠湖','张裕摩塞尔十五世酒庄','西夏陵'],
            '福建':['鼓浪屿','南普陀寺','环岛路','厦门大学','厦门胡里山炮台','曾厝垵','毓园','龙头路','菽庄花园','集美学村','日光岩','厦门中山路步行街','港仔后海滨浴场','福建厦门百年鼓浪屿景区','武夷山','海天堂构','永定土楼','海底世界','白鹿洞','皓月园','厦门鼓浪屿红地毯蜡像馆','梦幻世界主题乐园','万石植物园','百年鼓浪屿博物馆','天游峰','一线天','梦幻水世界','大嶝岛','观音山梦幻海岸','五缘湾湿地公园','厦门老院子民俗风情园','九曲溪景区','云水谣','厦门方特梦幻王国','厦门惠和石文化园','厦门博饼民俗园','海湾公园','陈嘉庚故居','世界名人蜡像馆','高崎国际机场','英雄三岛','虎啸岩','虎溪岩','古龙酱文化园','厦门海上明珠观光塔','厦门科技馆','厦门市鼓浪屿东方鱼骨艺术馆','厦门国际会展中心','嘉庚园','北站','厦门观音山沙雕文化公园','筼筜湖','陈嘉庚纪念馆','园博苑','琴园','丽田园休闲农庄','海上看金门','中山路','厦门海沧野生动物园','鼓浪屿协和礼拜堂','武夷宫','五缘湾水上迷宫','厦门南顺鳄鱼园','厦门日月谷温泉','罗源湾海洋世界','同安影视城','厦门金穗园温泉','盛之乡戴斯温泉','东坪山公园','厦门天沐温泉','贵安欢乐世界','天竺山森林公园','海行者帆船俱乐部','厦门小嶝渔村','豪威莱斯房车露营公园','演武大桥','郑成功纪念馆','厦门五峰德安古堡','顶上人家乡村度假区','野生谷','野山谷','红枪帆船俱乐部','厦门嘉庚公园','黄荣远堂','厦门音乐广场','京闽盛之乡温泉','诚毅科技探索中心','贝壳梦幻世界','大清厦门一等邮局遗址','后空间','海沧大桥','百鸟园','厦门金光湖','五缘大桥','小嶝岛','厦门中华儿女美术馆','大屏山公园','通士达光影体验馆','厦门园林博览苑']}


    # '重庆':['天坑三硚','仙女山','武隆地缝','天生三桥','长江三峡','洪崖洞','三峡大坝','重庆奉节白帝城','渣滓洞','白公馆','磁器口','丰都鬼城','龙水峡地缝','瞿塘峡','石宝寨','重庆湖广会馆','巫峡','芙蓉洞','重庆巫山小三峡','大足石刻','重庆神女溪','芙蓉洞','云阳龙缸','西陵峡风景区','重庆云阳张飞庙','黑山谷','三峡橘海景区','阿依河','龚滩古镇','乌江画廊','鬼城丰都','乐和乐都主题公园','重庆永川茶山竹海','重庆长江索道','芙蓉江','巫山','重庆野生动物园','重庆长寿湖','解放碑步行街','抗战遗址博物馆','重庆解放碑','长寿古镇','桃花源','大木花谷','西陵峡口','大佛寺','重庆人民大礼堂','濯水古镇','三峡人家风景区','金佛山','重庆万盛区龙鳞石海','科技馆','大木花谷','千野草场','万州大瀑布','小南海','红池坝国家森林公园','佛影峡','黄水','虎峰山','金凤','加勒比水世界','钓鱼城','重庆影视城','高峡平湖','神龟峡','涞滩古镇','四面山国家重点风景名胜区','神龙峡','统景','东温泉','张关水溶洞','重庆龙门阵欢乐水魔方','重庆航空温泉','北峰山','重庆海昌加勒比海水世界','重庆海棠晓月温泉温泉度假圣地','垫江牡丹生态旅游区','长江三峡','武隆天坑寨子景区','东方民族温泉','朝天门码头','嘉陵江','重庆皇池水会','龙兴古镇','南川北固','坛子岭','锦里','重庆金源方特科幻公园','黔江风景区','三峡大瀑布','宽窄巷子','杜甫草堂','乐天花谷','重庆兰花科技园','重庆十八梯','宝顶山','都江堰','金沙遗址'],
    # '山东':['崂山','五四广场','奥帆中心','小青岛公园','栈桥','定远舰','刘公岛','八仙渡','青岛海底世界','北九水','黄岛金沙滩','青岛葡萄酒博物馆','八大关','蓬莱阁','青岛海昌极地海洋世界','青岛方特梦幻王国','大珠山','胶州湾跨海大桥','刘公岛博览园','泰山风景名胜区','奥运观光塔','崂山垭口','八水河','青岛海上观光','华严寺','青岛啤酒博物馆','蓬莱','水准零点','曲阜孔庙、孔府、孔林','仰口风景游览区','青岛天主教堂','信号山','旅顺蛇博物馆','星海广场','德式官邸旧址','趵突泉','石老人海水浴场','海云庵民俗文化馆','青岛奥帆奇幻世界','小鱼山公园','第一海水浴场','东鸡冠山日俄战争遗址','巨峰','太清宫','汇泉海水浴场','青岛德国总督楼旧址博物馆','龙潭瀑布','军港公园','中山公园','音乐广场','鲁迅公园','第二海水浴场','康有为故居','花石楼','石老人观光园','孔林','孔府','凤凰峡','灵山岛','即墨','大泽山','海军博物馆','青岛森林野生动物世界','夏庄','琅琊台景区','琅琊台','琅琊古城','天柱山摩崖刻石','灵珠山滑雪场','清闲庄园滑雪场','华夏城','华东百利酒庄','毛公山','金山滑雪场','孔庙','济南大明湖公园','海泉湾温泉','劈柴院','城投温泉','虎雕广场','八仙过海','银沙滩','青岛信号山公园','汤泊温泉','金麒玉麟温泉','胶澳总督府','艾丽华温泉','白鹭湖温泉','即墨温泉','鸿源御都温泉','天泰温泉','香根温泉','日月谷假日温泉','南天门','旅顺','十八盘','青岛海泉湾度假区','曲阜旅游','海阳海立方欢乐水世界']}
    print type(fengjing)
    content = fengjing(url,fengjng).get_url()
    endtime = time.time()
    print 'all time', endtime - starttime
